# 변수 참조

a2 = 10

def test2():
    print(a2)
    
test2()

print("--------------------------------------------------")

a = 10

def test():
    a = 20
    print(a)
    
test()

print("--------------------------------------------------")

a1 = 10

def test1():
    print(a1)
    
test1()

print("--------------------------------------------------")

a3 = 10

def test3():
    a3 = 20
    print(a3)
    
test3()
print(a3)

print("test4--------------------------------------------------")

a4 = 10

def test4():
    global a4
    a4 = 20
    
test4()
print(a4)